modules/gateway/gateway-api/src/test/resources/com/l7tech/gateway/api/testMessages/Service_PutWsdl_Response.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:l7="http://ns.l7tech.com/2010/01/gateway-management" xmlns:mdo="http://schemas.wiseman.dev.java.net/metadata/messagetypes" xmlns:mex="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wsmeta="http://schemas.dmtf.org/wbem/wsman/1/wsman/version1.0.0.a/default-addressing-model.xsd" xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:xs="http://www.w3.org/2001/XMLSchema"><env:Header><wsa:Action xmlns:ns11="http://ns.l7tech.com/2010/01/gateway-management" env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/PutResponse</wsa:Action><wsman:FragmentTransfer Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116" env:mustUnderstand="true" xmlns:l7="http://ns.l7tech.com/2010/01/gateway-management">l7:Resources/l7:ResourceSet[@tag='wsdl']</wsman:FragmentTransfer><wsa:MessageID env:mustUnderstand="true">uuid:5f933d5a-8e9e-4bf2-969d-6be97328bdde</wsa:MessageID><wsa:RelatesTo>uuid:9f46e293-2578-4594-8f93-c211240fb9f4</wsa:RelatesTo><wsa:To env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To></env:Header><env:Body xmlns:ns9="http://ns.l7tech.com/2010/01/gateway-management"><wsman:XmlFragment><ns9:ResourceSet rootUrl="http://hugh.l7tech.com/ACMEWarehouseWS/Service1.asmx?wsdl" tag="wsdl" xmlns=""><ns9:Resource sourceUrl="http://hugh.l7tech.com/ACMEWarehouseWS/Service1.asmx?wsdl" type="wsdl">&lt;wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://warehouse.acme.com/ws"/&gt;</ns9:Resource></ns9:ResourceSet></wsman:XmlFragment></env:Body></env:Envelope>